zephyrproject-rtos/zephyr/drivers/pwm/pwm_mspm0.c
/*
 * Copyright (c) 2025, Linumiz GmbH
 * Copyright (c) 2026, Texas Instruments Incorporated
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT ti_mspm0_timer_pwm

#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/mspm0_clock_control.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/pwm.h>
#include <zephyr/irq.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>

LOG_MODULE_REGISTER(pwm_mspm0, CONFIG_PWM_LOG_LEVEL);

/* GPTIMER register map — TRM Chapter 34 */

struct mspm0_gptimer_gprcm {
	volatile uint32_t PWREN;
	volatile uint32_t RSTCTL;
	uint32_t RESERVED[3];
	volatile uint32_t STAT;
};

struct mspm0_gptimer_int {
	volatile uint32_t IIDX;
	uint32_t RESERVED0;
	volatile uint32_t IMASK;
	uint32_t RESERVED1;
	volatile uint32_t RIS;
	uint32_t RESERVED2;
	volatile uint32_t MIS;
	uint32_t RESERVED3;
	volatile uint32_t ISET;
	uint32_t RESERVED4;
	volatile uint32_t ICLR;
};

struct mspm0_gptimer_common {
	volatile uint32_t CCPD;
	volatile uint32_t ODIS;
	volatile uint32_t CCLKCTL;
	volatile uint32_t CPS;
	volatile uint32_t CPSV;
	volatile uint32_t CTTRIGCTL;
	uint32_t RESERVED0;
	volatile uint32_t CTTRIG;
	volatile uint32_t FSCTL;
	volatile uint32_t GCTL;
};

/* Extended COUNTERREGS: covers CC control/action/filter registers for PWM */
struct mspm0_gptimer_counter_regs {
	volatile uint32_t CTR;         /* +0x00 (0x1800) */
	volatile uint32_t CTRCTL;      /* +0x04 */
	volatile uint32_t LOAD;        /* +0x08 */
	uint32_t RESERVED0;            /* +0x0C */
	volatile uint32_t CC_01[2];    /* +0x10 — CC ch0/ch1 */
	volatile uint32_t CC_23[2];    /* +0x18 — CC ch2/ch3 */
	volatile uint32_t CC_45[2];    /* +0x20 */
	uint32_t RESERVED1[2];         /* +0x28 */
	volatile uint32_t CCCTL_01[2]; /* +0x30 (0x1830) */
	volatile uint32_t CCCTL_23[2]; /* +0x38 */
	volatile uint32_t CCCTL_45[2]; /* +0x40 */
	uint32_t RESERVED2[2];         /* +0x48 */
	volatile uint32_t OCTL_01[2];  /* +0x50 (0x1850) */
	volatile uint32_t OCTL_23[2];  /* +0x58 */
	uint32_t RESERVED3[4];         /* +0x60 */
	volatile uint32_t CCACT_01[2]; /* +0x70 (0x1870) */
	volatile uint32_t CCACT_23[2]; /* +0x78 */
	volatile uint32_t IFCTL_01[2]; /* +0x80 (0x1880) */
	volatile uint32_t IFCTL_23[2]; /* +0x88 */
};

struct mspm0_gptimer_regs {
	uint32_t RESERVED0[256];
	volatile uint32_t FSUB_0;
	volatile uint32_t FSUB_1;
	uint32_t RESERVED1[15];
	volatile uint32_t FPUB_0;
	volatile uint32_t FPUB_1;
	uint32_t RESERVED2[237];
	struct mspm0_gptimer_gprcm GPRCM; /* 0x800 */
	uint32_t RESERVED3[506];
	volatile uint32_t CLKDIV; /* 0x1000 */
	uint32_t RESERVED4;
	volatile uint32_t CLKSEL; /* 0x1008 */
	uint32_t RESERVED5[3];
	volatile uint32_t PDBGCTL;
	uint32_t RESERVED6;
	struct mspm0_gptimer_int CPU_INT; /* 0x1020 */
	uint32_t RESERVED7;
	struct mspm0_gptimer_int GEN_EVENT0; /* 0x1050 */
	uint32_t RESERVED8;
	struct mspm0_gptimer_int GEN_EVENT1; /* 0x1080 */
	uint32_t RESERVED9[13];
	volatile uint32_t EVT_MODE;
	uint32_t RESERVED10[6];
	volatile uint32_t DESC;
	struct mspm0_gptimer_common COMMONREGS; /* 0x1100 */
	uint32_t RESERVED11[438];
	struct mspm0_gptimer_counter_regs COUNTERREGS; /* 0x1800 */
};

BUILD_ASSERT(offsetof(struct mspm0_gptimer_regs, GPRCM) == 0x0800U);
BUILD_ASSERT(offsetof(struct mspm0_gptimer_regs, CLKDIV) == 0x1000U);
BUILD_ASSERT(offsetof(struct mspm0_gptimer_regs, CPU_INT) == 0x1020U);
BUILD_ASSERT(offsetof(struct mspm0_gptimer_regs, COMMONREGS) == 0x1100U);
BUILD_ASSERT(offsetof(struct mspm0_gptimer_regs, COUNTERREGS) == 0x1800U);
BUILD_ASSERT(offsetof(struct mspm0_gptimer_counter_regs, CCCTL_01) == 0x30U);
BUILD_ASSERT(offsetof(struct mspm0_gptimer_counter_regs, CCACT_01) == 0x70U);
BUILD_ASSERT(offsetof(struct mspm0_gptimer_counter_regs, IFCTL_01) == 0x80U);

#ifndef CONFIG_HAS_MSPM0_SDK

/* GPRCM.PWREN */
#define GPTIMER_PWREN_KEY_UNLOCK_W      0x26000000U
#define GPTIMER_PWREN_ENABLE_ENABLE     0x00000001U

/* GPRCM.RSTCTL */
#define GPTIMER_RSTCTL_KEY_UNLOCK_W         0xB1000000U
#define GPTIMER_RSTCTL_RESETSTKYCLR_CLR     0x00000002U
#define GPTIMER_RSTCTL_RESETASSERT_ASSERT   0x00000001U

/* COUNTERREGS.CTRCTL */
#define GPTIMER_CTRCTL_EN_ENABLED       0x00000001U
#define GPTIMER_CTRCTL_EN_MASK          0x00000001U
#define GPTIMER_CTRCTL_REPEAT_REPEAT_1  0x00000002U
#define GPTIMER_CTRCTL_CM_DOWN          0x00000000U
#define GPTIMER_CTRCTL_CM_UP_DOWN       0x00000010U
#define GPTIMER_CTRCTL_CM_UP            0x00000020U
#define GPTIMER_CTRCTL_CVAE_ZEROVAL     0x20000000U

/* COMMONREGS */
#define GPTIMER_CCLKCTL_CLKEN_ENABLED   0x00000001U

/* CCCTL_01/23 */
#define GPTIMER_CCCTL_01_COC_COMPARE            0x00000000U
#define GPTIMER_CCCTL_01_COC_CAPTURE            0x00020000U
#define GPTIMER_CCCTL_01_CCUPD_ZERO_EVT         0x00040000U
#define GPTIMER_CCCTL_01_CCUPD_ZERO_LOAD_EVT    0x00100000U
#define GPTIMER_CCCTL_01_CCOND_CC_TRIG_RISE     0x00000001U
#define GPTIMER_CCCTL_01_CCOND_CC_TRIG_FALL     0x00000002U

/* CCACT_01/23 — output pin actions */
#define GPTIMER_CCACT_01_ZACT_CCP_HIGH  0x00000001U
#define GPTIMER_CCACT_01_ZACT_CCP_LOW   0x00000002U
#define GPTIMER_CCACT_01_LACT_CCP_HIGH  0x00000008U
#define GPTIMER_CCACT_01_LACT_CCP_LOW   0x00000010U
#define GPTIMER_CCACT_01_CDACT_CCP_LOW  0x00000080U
#define GPTIMER_CCACT_01_CDACT_CCP_HIGH 0x00000040U
#define GPTIMER_CCACT_01_CUACT_CCP_LOW  0x00000400U
#define GPTIMER_CCACT_01_CUACT_CCP_HIGH 0x00000200U

/* IFCTL_01/23 ISEL */
#define GPTIMER_IFCTL_01_ISEL_CCPX_INPUT        0x00000000U
#define GPTIMER_IFCTL_01_ISEL_CCPX_INPUT_PAIR   0x00000001U
#define GPTIMER_IFCTL_01_ISEL_CCP0_INPUT        0x00000002U

#endif /* CONFIG_HAS_MSPM0_SDK */

#define GPTIMER_CCPD_OUTPUT_MASK(ch) BIT(ch)

/* CPU_INT interrupt bits — same position in IMASK, RIS, ICLR */
#define GPTIMER_INT_ZERO_BIT     BIT(0) /* Z: zero/underflow event */
#define GPTIMER_INT_CCD_MASK(ch) BIT(4U + (ch))

#define MSPM0_TIMER_CC_MAX 4U

enum pwm_mspm0_mode {
	PWM_MSPM0_EDGE_ALIGN,    /* down-count: LACT=LOW, CDACT=HIGH */
	PWM_MSPM0_EDGE_ALIGN_UP, /* up-count:   ZACT=HIGH, CUACT=LOW */
	PWM_MSPM0_CENTER_ALIGN,  /* up-down:    CUACT=HIGH, CDACT=LOW */
};

