zephyrproject-rtos/zephyr/drivers/pwm/pwm_mspm0.c
#ifdef CONFIG_PWM_CAPTURE
enum mspm0_capture_mode {
	CMODE_EDGE_TIME,
	CMODE_PULSE_WIDTH,
};
#endif

struct pwm_mspm0_config {
	struct mspm0_gptimer_regs *base;
	const struct device *clock_dev;
	const struct pinctrl_dev_config *pincfg;
	struct mspm0_sys_clock clock_subsys;
	uint32_t clk_sel;
	uint32_t clk_div_reg; /* CLKDIV value: ti_clk_div - 1 */
	uint8_t prescaler;
	enum pwm_mspm0_mode mode;
	uint8_t cc_idx[MSPM0_TIMER_CC_MAX];
	uint8_t cc_idx_cnt;
	bool is_capture;
#ifdef CONFIG_PWM_CAPTURE
	void (*irq_config_func)(const struct device *dev);
#endif
};

struct pwm_mspm0_data {
	uint32_t pulse_cycle[MSPM0_TIMER_CC_MAX];
	uint32_t period;
	uint32_t freq_hz;
	struct k_mutex lock;
#ifdef CONFIG_PWM_CAPTURE
	uint32_t last_sample;
	enum mspm0_capture_mode cmode;
	pwm_capture_callback_handler_t callback;
	pwm_flags_t flags;
	void *user_data;
	bool is_synced;
	bool armed;
#endif
};


static inline void mspm0_pwm_write_cc(struct mspm0_gptimer_regs *base, uint8_t ch, uint32_t val)
{
	if (ch < 2U) {
		base->COUNTERREGS.CC_01[ch] = val;
	} else {
		base->COUNTERREGS.CC_23[ch - 2U] = val;
	}
}

static inline uint32_t mspm0_pwm_read_cc(struct mspm0_gptimer_regs *base, uint8_t ch)
{
	if (ch < 2U) {
		return base->COUNTERREGS.CC_01[ch];
	}
	return base->COUNTERREGS.CC_23[ch - 2U];
}

static inline void mspm0_pwm_write_ccctl(struct mspm0_gptimer_regs *base, uint8_t ch, uint32_t val)
{
	if (ch < 2U) {
		base->COUNTERREGS.CCCTL_01[ch] = val;
	} else {
		base->COUNTERREGS.CCCTL_23[ch - 2U] = val;
	}
}

static inline void mspm0_pwm_write_ccact(struct mspm0_gptimer_regs *base, uint8_t ch, uint32_t val)
{
	if (ch < 2U) {
		base->COUNTERREGS.CCACT_01[ch] = val;
	} else {
		base->COUNTERREGS.CCACT_23[ch - 2U] = val;
	}
}

static inline void mspm0_pwm_write_octl(struct mspm0_gptimer_regs *base, uint8_t ch, uint32_t val)
{
	if (ch < 2U) {
		base->COUNTERREGS.OCTL_01[ch] = val;
	} else {
		base->COUNTERREGS.OCTL_23[ch - 2U] = val;
	}
}

static inline void mspm0_pwm_write_ifctl(struct mspm0_gptimer_regs *base, uint8_t ch, uint32_t val)
{
	if (ch < 2U) {
		base->COUNTERREGS.IFCTL_01[ch] = val;
	} else {
		base->COUNTERREGS.IFCTL_23[ch - 2U] = val;
	}
}


/*
 * DOWN-counting EDGE_ALIGN: LACT (reload) and CDACT (CC match) toggle the
 * pin so it's HIGH for exactly `pulse` ticks. At the 0% and 100% duty
 * boundaries CC coincides with LOAD/reload, so LACT and CDACT would fire
 * on the same tick — pick a single fixed action instead of toggling to
 * avoid a spurious 1-tick glitch at either extreme.
 */
static inline uint32_t mspm0_pwm_edge_align_ccact(uint32_t pulse, uint32_t load)
{
	if (pulse == 0U) {
		return GPTIMER_CCACT_01_LACT_CCP_LOW;
	}
	if (pulse >= load) {
		return GPTIMER_CCACT_01_LACT_CCP_HIGH;
	}
	return GPTIMER_CCACT_01_LACT_CCP_LOW | GPTIMER_CCACT_01_CDACT_CCP_HIGH;
}

/*
 * UP-counting EDGE_ALIGN_UP: ZACT (zero/restart) sets HIGH, CUACT (CC match
 * going up) sets LOW, giving pulse ticks of HIGH from 0 to CC. At 0% and
 * 100% both events fire on the same tick; use a single sticky action instead.
 */
static inline uint32_t mspm0_pwm_edge_align_up_ccact(uint32_t pulse, uint32_t load)
{
	if (pulse == 0U) {
		return GPTIMER_CCACT_01_ZACT_CCP_LOW;
	}
	if (pulse >= load) {
		return GPTIMER_CCACT_01_ZACT_CCP_HIGH;
	}
	return GPTIMER_CCACT_01_ZACT_CCP_HIGH | GPTIMER_CCACT_01_CUACT_CCP_LOW;
}

/*
 * UP-DOWN counting CENTER_ALIGN: LOAD holds period/2 (up-down counting
 * doubles the effective tick count). CC must be the symmetric offset from
 * the peak that gives `pulse` total ticks of HIGH time: load - pulse/2.
 */
static inline uint32_t mspm0_pwm_center_align_cc(uint32_t load, uint32_t pulse)
{
	return load - (pulse / 2U);
}

static void mspm0_pwm_setup_cc_chan(struct mspm0_gptimer_regs *base, uint8_t ch,
				   enum pwm_mspm0_mode mode, uint32_t pulse)
{
	uint32_t ccact;
	uint32_t ccupd;
	uint32_t cc_val = pulse;

	switch (mode) {
	case PWM_MSPM0_EDGE_ALIGN:
		ccact = mspm0_pwm_edge_align_ccact(pulse, base->COUNTERREGS.LOAD);
		ccupd = GPTIMER_CCCTL_01_CCUPD_ZERO_EVT;
		break;
	case PWM_MSPM0_EDGE_ALIGN_UP:
		ccact = mspm0_pwm_edge_align_up_ccact(pulse, base->COUNTERREGS.LOAD);
		ccupd = GPTIMER_CCCTL_01_CCUPD_ZERO_EVT;
		break;
	default: /* PWM_MSPM0_CENTER_ALIGN */
		ccact = GPTIMER_CCACT_01_CUACT_CCP_HIGH | GPTIMER_CCACT_01_CDACT_CCP_LOW;
		ccupd = GPTIMER_CCCTL_01_CCUPD_ZERO_LOAD_EVT;
		cc_val = mspm0_pwm_center_align_cc(base->COUNTERREGS.LOAD, pulse);
		break;
	}

	mspm0_pwm_write_ccact(base, ch, ccact);
	mspm0_pwm_write_ccctl(base, ch, GPTIMER_CCCTL_01_COC_COMPARE | ccupd);
	mspm0_pwm_write_octl(base, ch, 0U);
	mspm0_pwm_write_ifctl(base, ch, GPTIMER_IFCTL_01_ISEL_CCPX_INPUT);
	mspm0_pwm_write_cc(base, ch, cc_val);
}

static void mspm0_setup_pwm_out(const struct pwm_mspm0_config *config,
				struct pwm_mspm0_data *data)
{
	struct mspm0_gptimer_regs *base = config->base;
	uint32_t ctrctl;
	uint32_t ccpd_mask = 0U;

	switch (config->mode) {
	case PWM_MSPM0_EDGE_ALIGN:
		ctrctl = GPTIMER_CTRCTL_CM_DOWN;
		break;
	case PWM_MSPM0_EDGE_ALIGN_UP:
		ctrctl = GPTIMER_CTRCTL_CM_UP | GPTIMER_CTRCTL_CVAE_ZEROVAL;
		break;
	default: /* PWM_MSPM0_CENTER_ALIGN */
		ctrctl = GPTIMER_CTRCTL_CM_UP_DOWN;
		break;
	}

	/*
	 * CENTER_ALIGN up-down counting doubles the effective tick count;
	 * LOAD must hold period/2. Use a local so data->period stays at the
	 * full configured value (avoids double-halving on any future reinit).
	 */
	uint32_t load = (config->mode == PWM_MSPM0_CENTER_ALIGN) ? (data->period >> 1)
								 : data->period;

	base->COUNTERREGS.LOAD = load;

	for (int i = 0; i < config->cc_idx_cnt; i++) {
		uint8_t ch = config->cc_idx[i];

		mspm0_pwm_setup_cc_chan(base, ch, config->mode, data->pulse_cycle[i]);
		ccpd_mask |= GPTIMER_CCPD_OUTPUT_MASK(ch);
	}

	base->COMMONREGS.CCPD |= ccpd_mask;
	base->COMMONREGS.CCLKCTL = GPTIMER_CCLKCTL_CLKEN_ENABLED;
	base->COUNTERREGS.CTRCTL =
		ctrctl | GPTIMER_CTRCTL_REPEAT_REPEAT_1 | GPTIMER_CTRCTL_EN_ENABLED;
}

static int mspm0_pwm_set_cycles(const struct device *dev, uint32_t channel,
			       uint32_t period_cycles, uint32_t pulse_cycles,
			       pwm_flags_t flags)
{
	const struct pwm_mspm0_config *config = dev->config;
	struct pwm_mspm0_data *data = dev->data;
	struct mspm0_gptimer_regs *base = config->base;
	uint32_t period;

	if (channel >= config->cc_idx_cnt) {
		LOG_ERR("Invalid channel %u", channel);
		return -EINVAL;
	}

