zephyrproject-rtos/zephyr/drivers/pwm/pwm_mspm0.c
	if (period_cycles == 0U || period_cycles > UINT16_MAX) {
		LOG_ERR("period_cycles %u out of range [1, %u]", period_cycles, UINT16_MAX);
		return -ENOTSUP;
	}

	if ((flags & PWM_POLARITY_INVERTED) && pulse_cycles > period_cycles) {
		LOG_ERR("pulse_cycles %u > period_cycles %u", pulse_cycles, period_cycles);
		return -EINVAL;
	}

	period = (config->mode == PWM_MSPM0_CENTER_ALIGN) ? (period_cycles >> 1) : period_cycles;

	if (flags & PWM_POLARITY_INVERTED) {
		pulse_cycles = period_cycles - pulse_cycles;
	}

	k_mutex_lock(&data->lock, K_FOREVER);

	data->pulse_cycle[channel] = pulse_cycles;
	data->period = period;

	base->COUNTERREGS.LOAD = period;

	if (config->mode == PWM_MSPM0_CENTER_ALIGN) {
		/*
		 * LOAD is shared across all channels; recompute every
		 * channel's CC so none drifts after a period change.
		 */
		for (int i = 0; i < config->cc_idx_cnt; i++) {
			mspm0_pwm_write_cc(base, config->cc_idx[i],
					  mspm0_pwm_center_align_cc(period, data->pulse_cycle[i]));
		}
	} else {
		mspm0_pwm_write_cc(base, config->cc_idx[channel], pulse_cycles);
	}

	if (config->mode == PWM_MSPM0_EDGE_ALIGN) {
		mspm0_pwm_write_ccact(base, config->cc_idx[channel],
				     mspm0_pwm_edge_align_ccact(pulse_cycles, period));
	}

	if (config->mode == PWM_MSPM0_EDGE_ALIGN_UP) {
		mspm0_pwm_write_ccact(base, config->cc_idx[channel],
				     mspm0_pwm_edge_align_up_ccact(pulse_cycles, period));
	}

	k_mutex_unlock(&data->lock);

	return 0;
}

static int mspm0_pwm_get_cycles_per_sec(const struct device *dev,
					uint32_t channel, uint64_t *cycles)
{
	ARG_UNUSED(channel);

	if (cycles == NULL) {
		return -EINVAL;
	}

	*cycles = ((const struct pwm_mspm0_data *)dev->data)->freq_hz;
	return 0;
}

#ifdef CONFIG_PWM_CAPTURE

/*
 * Which channel triggers the capture interrupt depends on cap_mode, not on
 * the requested capture TYPE: PULSE_WIDTH always triggers on the rise
 * channel (cc_idx[0]^1) regardless of PERIOD/PULSE/BOTH, since that's the
 * only channel actually wired to fire an interrupt (mspm0_setup_capture()
 * never arms cc_idx[0]'s own interrupt in PULSE_WIDTH mode). Gating on the
 * TYPE flags instead of cap_mode would arm the wrong, unconfigured channel
 * for EDGE_TIME mode whenever PERIOD/PULSE/BOTH is requested there.
 */
static uint32_t mspm0_pwm_cap_intr_mask(const struct pwm_mspm0_config *config,
				       const struct pwm_mspm0_data *data)
{
	if (data->cmode == CMODE_PULSE_WIDTH) {
		return GPTIMER_INT_CCD_MASK(config->cc_idx[0] ^ 1U) | GPTIMER_INT_ZERO_BIT;
	}
	return GPTIMER_INT_CCD_MASK(config->cc_idx[0]);
}

static void mspm0_setup_capture(const struct device *dev,
				const struct pwm_mspm0_config *config,
				struct pwm_mspm0_data *data)
{
	struct mspm0_gptimer_regs *base = config->base;

	base->COUNTERREGS.LOAD = data->period;

	if (data->cmode == CMODE_EDGE_TIME) {
		uint8_t ch = config->cc_idx[0];
		uint32_t isel = (ch & 1U) ? GPTIMER_IFCTL_01_ISEL_CCPX_INPUT
					  : GPTIMER_IFCTL_01_ISEL_CCP0_INPUT;

		mspm0_pwm_write_ccctl(base, ch,
				     GPTIMER_CCCTL_01_COC_CAPTURE |
					     GPTIMER_CCCTL_01_CCOND_CC_TRIG_RISE);
		mspm0_pwm_write_ifctl(base, ch, isel);
		base->COMMONREGS.CCPD &= ~GPTIMER_CCPD_OUTPUT_MASK(ch);
		base->COUNTERREGS.CTRCTL = GPTIMER_CTRCTL_CM_DOWN | GPTIMER_CTRCTL_REPEAT_REPEAT_1;
	} else {
		uint8_t ch_fall = config->cc_idx[0];
		uint8_t ch_rise = ch_fall ^ 1U;
		uint32_t isel_fall = (ch_fall & 1U) ? GPTIMER_IFCTL_01_ISEL_CCPX_INPUT
						    : GPTIMER_IFCTL_01_ISEL_CCP0_INPUT;

		mspm0_pwm_write_ccctl(base, ch_fall,
				     GPTIMER_CCCTL_01_COC_CAPTURE |
					     GPTIMER_CCCTL_01_CCOND_CC_TRIG_FALL);
		mspm0_pwm_write_ifctl(base, ch_fall, isel_fall);

		mspm0_pwm_write_ccctl(base, ch_rise,
				     GPTIMER_CCCTL_01_COC_CAPTURE |
					     GPTIMER_CCCTL_01_CCOND_CC_TRIG_RISE);
		mspm0_pwm_write_ifctl(base, ch_rise, GPTIMER_IFCTL_01_ISEL_CCPX_INPUT_PAIR);

		base->COMMONREGS.CCPD &=
			~(GPTIMER_CCPD_OUTPUT_MASK(ch_fall) | GPTIMER_CCPD_OUTPUT_MASK(ch_rise));
		base->COUNTERREGS.CTRCTL = GPTIMER_CTRCTL_CM_DOWN | GPTIMER_CTRCTL_REPEAT_REPEAT_1;
	}

	base->COMMONREGS.CCLKCTL = GPTIMER_CCLKCTL_CLKEN_ENABLED;
	config->irq_config_func(dev);
}

static int mspm0_capture_configure(const struct device *dev,
				   uint32_t channel,
				   pwm_flags_t flags,
				   pwm_capture_callback_handler_t cb,
				   void *user_data)
{
	const struct pwm_mspm0_config *config = dev->config;
	struct pwm_mspm0_data *data = dev->data;
	uint32_t intr_mask;

	if (config->is_capture != true ||
	    channel != 0) {
		LOG_ERR("Invalid channel %d", channel);
		return -EINVAL;
	}

	intr_mask = mspm0_pwm_cap_intr_mask(config, data);

	k_mutex_lock(&data->lock, K_FOREVER);

	if (config->base->CPU_INT.IMASK & intr_mask) {
		LOG_ERR("Channel %u busy", channel);
		k_mutex_unlock(&data->lock);
		return -EBUSY;
	}

	data->flags = flags;
	data->callback = cb;
	data->user_data = user_data;

	if (data->cmode == CMODE_PULSE_WIDTH) {
		struct mspm0_gptimer_regs *base = config->base;
		uint8_t ch_fall = config->cc_idx[0];
		uint8_t ch_rise = ch_fall ^ 1U;
		bool inverted = flags & PWM_POLARITY_INVERTED;

		/*
		 * "pulse" is always computed as (time of ch_rise's edge) -
		 * (time of ch_fall's edge). Under normal polarity that is
		 * RISE-to-FALL, i.e. the HIGH duration. Under inverted
		 * polarity the caller expects "pulse" to mean the LOW
		 * duration instead, so swap which physical edge each
		 * channel captures: ch_fall now triggers on RISE and
		 * ch_rise now triggers on FALL, making the same
		 * last_sample-minus-cc0 formula yield FALL-to-RISE (the
		 * LOW duration). Mirrors the edge-swap approach used by
		 * pwm_stm32's init_capture_channels().
		 */
		mspm0_pwm_write_ccctl(base, ch_fall,
				     GPTIMER_CCCTL_01_COC_CAPTURE |
					     (inverted ? GPTIMER_CCCTL_01_CCOND_CC_TRIG_RISE
						       : GPTIMER_CCCTL_01_CCOND_CC_TRIG_FALL));
		mspm0_pwm_write_ccctl(base, ch_rise,
				     GPTIMER_CCCTL_01_COC_CAPTURE |
					     (inverted ? GPTIMER_CCCTL_01_CCOND_CC_TRIG_FALL
						       : GPTIMER_CCCTL_01_CCOND_CC_TRIG_RISE));
	}

	k_mutex_unlock(&data->lock);
	return 0;
}

static int mspm0_capture_enable(const struct device *dev, uint32_t channel)
{
	const struct pwm_mspm0_config *config = dev->config;
	struct pwm_mspm0_data *data = dev->data;
	struct mspm0_gptimer_regs *base = config->base;
	uint32_t intr_mask;

	if (config->is_capture != true ||
	    channel != 0) {
		LOG_ERR("Invalid capture mode or channel");
		return -EINVAL;
	}

