zephyrproject-rtos/zephyr/drivers/pwm/pwm_mspm0.c
	if (!data->callback) {
		LOG_ERR("No capture callback configured");
		return -EINVAL;
	}

	intr_mask = mspm0_pwm_cap_intr_mask(config, data);

	k_mutex_lock(&data->lock, K_FOREVER);

	if (base->CPU_INT.IMASK & intr_mask) {
		LOG_ERR("Channel %u busy", channel);
		k_mutex_unlock(&data->lock);
		return -EBUSY;
	}

	/*
	 * Re-baseline on every arm, not just after disable_capture(): a
	 * caller may legitimately re-enable without disabling first (e.g.
	 * back-to-back single-shot captures), and the CC registers may hold
	 * a stale capture from whatever ran before this arm.
	 */
	data->is_synced = false;
	data->armed = false;

	base->COUNTERREGS.CTR = data->period;
	base->COUNTERREGS.CTRCTL |= GPTIMER_CTRCTL_EN_ENABLED;
	base->CPU_INT.ICLR = intr_mask;
	base->CPU_INT.IMASK |= intr_mask;

	k_mutex_unlock(&data->lock);
	return 0;
}

static int mspm0_capture_disable(const struct device *dev, uint32_t channel)
{
	const struct pwm_mspm0_config *config = dev->config;
	struct pwm_mspm0_data *data = dev->data;
	struct mspm0_gptimer_regs *base = config->base;
	uint32_t intr_mask;

	if (config->is_capture != true ||
	    channel != 0) {
		LOG_ERR("Invalid channel");
		return -EINVAL;
	}

	intr_mask = mspm0_pwm_cap_intr_mask(config, data);

	k_mutex_lock(&data->lock, K_FOREVER);

	base->CPU_INT.IMASK &= ~intr_mask;
	base->COUNTERREGS.CTRCTL &= ~GPTIMER_CTRCTL_EN_MASK;
	data->is_synced = false;
	data->armed = false;

	k_mutex_unlock(&data->lock);
	return 0;
}

#endif /* CONFIG_PWM_CAPTURE */

static int pwm_mspm0_init(const struct device *dev)
{
	const struct pwm_mspm0_config *config = dev->config;
	struct pwm_mspm0_data *data = dev->data;
	struct mspm0_gptimer_regs *base = config->base;
	uint32_t clock_rate;
	int ret;

	k_mutex_init(&data->lock);

	if (!device_is_ready(config->clock_dev)) {
		LOG_ERR("clock control device not ready");
		return -ENODEV;
	}

	struct mspm0_sys_clock clock_subsys = config->clock_subsys;

	ret = clock_control_get_rate(config->clock_dev,
				     (clock_control_subsys_t)&clock_subsys, &clock_rate);
	if (ret != 0) {
		LOG_ERR("clk get rate err %d", ret);
		return ret;
	}

	ret = pinctrl_apply_state(config->pincfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		return ret;
	}

	base->GPRCM.RSTCTL = GPTIMER_RSTCTL_KEY_UNLOCK_W | GPTIMER_RSTCTL_RESETSTKYCLR_CLR |
			     GPTIMER_RSTCTL_RESETASSERT_ASSERT;
	base->GPRCM.PWREN = GPTIMER_PWREN_KEY_UNLOCK_W | GPTIMER_PWREN_ENABLE_ENABLE;
	k_busy_wait(1U);

	base->CLKSEL = config->clk_sel;
	base->CLKDIV = config->clk_div_reg;
	base->COMMONREGS.CPS = config->prescaler;

	data->freq_hz =
		clock_rate / ((config->clk_div_reg + 1U) * ((uint32_t)config->prescaler + 1U));

	base->CPU_INT.IMASK = 0U;
	base->CPU_INT.ICLR = 0xFFFFFFFFU;

	if (config->is_capture) {
#ifdef CONFIG_PWM_CAPTURE
		mspm0_setup_capture(dev, config, data);
#endif
	} else {
		mspm0_setup_pwm_out(config, data);
	}

	return 0;
}

static DEVICE_API(pwm, pwm_mspm0_driver_api) = {
	.set_cycles = mspm0_pwm_set_cycles,
	.get_cycles_per_sec = mspm0_pwm_get_cycles_per_sec,
#ifdef CONFIG_PWM_CAPTURE
	.configure_capture = mspm0_capture_configure,
	.enable_capture = mspm0_capture_enable,
	.disable_capture = mspm0_capture_disable,
#endif
};

#ifdef CONFIG_PWM_CAPTURE

static void mspm0_cc_isr(const struct device *dev)
{
	const struct pwm_mspm0_config *config = dev->config;
	struct pwm_mspm0_data *data = dev->data;
	struct mspm0_gptimer_regs *base = config->base;
	uint32_t raw_ris;
	uint32_t ris;
	uint32_t cc1 = 0;
	uint32_t cc0 = 0;
	uint32_t period = 0;
	uint32_t pulse = 0;

	/*
	 * Clear every pending bit (raw_ris), not just the ones relevant to
	 * this capture (ris), so coincidental compare matches on unrelated
	 * CC channels (e.g. CC4/CC5 defaulting to COMPARE mode with CC=0)
	 * don't linger set in RIS indefinitely.
	 */
	raw_ris = base->CPU_INT.RIS;
	ris = raw_ris & mspm0_pwm_cap_intr_mask(config, data);
	base->CPU_INT.ICLR = raw_ris;

	if (!ris) {
		return;
	}

	if (ris & GPTIMER_INT_ZERO_BIT) {
		if (!(data->flags & PWM_CAPTURE_MODE_CONTINUOUS)) {
			if (data->callback) {
				data->callback(dev, 0, 0, 0, -ERANGE, data->user_data);
				base->COUNTERREGS.CTRCTL &= ~GPTIMER_CTRCTL_EN_MASK;
			}
			return;
		}
		/*
		 * Continuous mode: ZERO is just the free-running counter's
		 * periodic wrap, not a capture error. A CC edge can land in
		 * the same ISR entry (the wrap period doesn't divide evenly
		 * into the PWM period) — fall through to process it instead
		 * of dropping it.
		 */
		if (!(ris & ~GPTIMER_INT_ZERO_BIT)) {
			return;
		}
	}

	if (data->cmode == CMODE_PULSE_WIDTH) {
		/*
		 * cc1 (rise-edge capture) is the interrupt trigger source for
		 * PULSE_WIDTH mode and the sync/period/pulse anchor for every
		 * capture type, not just PWM_CAPTURE_TYPE_PERIOD. Gating this
		 * read on the PERIOD flag left cc1/last_sample stuck at 0 for
		 * PULSE-only captures, making period compute to 0 and the
		 * capture callback never fire (timeout).
		 */
		cc1 = mspm0_pwm_read_cc(base, config->cc_idx[0] ^ 1U);
	}

	if (!data->is_synced && data->cmode != CMODE_EDGE_TIME) {
		data->last_sample = cc1;
		data->is_synced = true;
		return;
	}

	if ((data->flags & PWM_CAPTURE_TYPE_PULSE) || data->cmode == CMODE_EDGE_TIME) {
		cc0 = mspm0_pwm_read_cc(base, config->cc_idx[0]);
	}

	if (data->cmode == CMODE_PULSE_WIDTH && !data->armed) {
		/*
		 * First full interval after arming can straddle a leftover
		 * edge from whatever waveform ran before capture was armed
		 * (e.g. pwm_set() right before enable_capture(), no settle
		 * delay). Discard it and re-baseline instead of reporting
		 * a bogus period/pulse.
		 */
		data->armed = true;
		data->last_sample = cc1;
		return;
	}

	if (!(data->flags & PWM_CAPTURE_MODE_CONTINUOUS)) {
		uint32_t mask = mspm0_pwm_cap_intr_mask(config, data);

		base->CPU_INT.IMASK &= ~mask;
		base->COUNTERREGS.CTRCTL &= ~GPTIMER_CTRCTL_EN_MASK;
		data->is_synced = false;
		data->armed = false;
	}

	if (data->cmode == CMODE_EDGE_TIME) {
		/*
		 * Single-channel edge-time mode: cc0 holds the current edge,
		 * last_sample holds the previous one. Both are counter values
		 * from a down-counter, so earlier == larger value.
		 */
		period = (data->last_sample - cc0) & 0xFFFFU;
		pulse = 0U;
		data->last_sample = cc0;
	} else {
		/*
		 * PULSE_WIDTH: interrupt triggers on cc1 (rise edge).
		 * cc0 = fall edge, cc1 = current rise, last_sample = prev rise.
		 * period = prev_rise - cur_rise, pulse = prev_rise - fall.
		 */
		period = (data->last_sample - cc1) & 0xFFFFU;
		pulse = (data->last_sample - cc0) & 0xFFFFU;

