zephyrproject-rtos/zephyr/drivers/pwm/pwm_mspm0.c
		/*
		 * Defensive guard: pulse > period can only occur if a stale
		 * fall edge pre-dates the previous rise (straddled arm). The
		 * `armed` discard above should prevent this, but keep the
		 * fallback for any unconfirmed edge case.
		 */
		if (pulse > period) {
			pulse -= period;
		}

		if (!(data->flags & PWM_CAPTURE_TYPE_PULSE)) {
			/* PERIOD-only: caller did not ask for pulse width. */
			pulse = 0U;
		}

		data->last_sample = cc1;
	}

	if (data->callback && period) {
		data->callback(dev, 0, period, pulse, 0, data->user_data);
	}
}

#endif /* CONFIG_PWM_CAPTURE */


/* Device instantiation */

#ifdef CONFIG_PWM_CAPTURE
#define MSP_CC_IRQ_REGISTER(n)                                                                   \
	static void mspm0_pwm_##n##_irq_register(const struct device *dev)                         \
	{                                                                                          \
		const struct pwm_mspm0_config *config = dev->config;                              \
		if (!config->is_capture) {                                                         \
			return;                                                                    \
		}                                                                                  \
		IRQ_CONNECT(DT_IRQN(DT_INST_PARENT(n)), DT_IRQ(DT_INST_PARENT(n), priority),       \
			    mspm0_cc_isr, DEVICE_DT_INST_GET(n), 0);                            \
		irq_enable(DT_IRQN(DT_INST_PARENT(n)));                                            \
	}
#else
#define MSP_CC_IRQ_REGISTER(n)
#endif

/* Only output-capable instances (no ti,cc-mode) skip ISR registration. */
#define MSP_CC_IRQ_REGISTER_IF_CAPTURE(n)                                                        \
	COND_CODE_1(DT_NODE_HAS_PROP(DT_DRV_INST(n), ti_cc_mode), (MSP_CC_IRQ_REGISTER(n)), ())

#define MSPM0_PWM_MODE(tok) _CONCAT(PWM_MSPM0_, tok)
#define MSPM0_CAPTURE_MODE(tok) _CONCAT(CMODE_, tok)

#define MSPM0_CC_IDX_ARRAY(node_id, prop, idx) DT_PROP_BY_IDX(node_id, prop, idx),

#define PWM_DEVICE_INIT_MSPM0(n)								\
	BUILD_ASSERT(DT_INST_PROP_LEN(n, ti_cc_index) <= MSPM0_TIMER_CC_MAX,			\
		     "ti,cc-index exceeds hardware maximum of 4");                                 \
	BUILD_ASSERT(DT_PROP(DT_INST_PARENT(n), ti_clk_div) >= 1,                                  \
		     "ti,clk-div must be >= 1 (0 underflows clk_div_reg)");                        \
										\
	static struct pwm_mspm0_data pwm_mspm0_data_##n = {					\
		.period = DT_PROP(DT_DRV_INST(n), ti_period),                                      \
		IF_ENABLED(CONFIG_PWM_CAPTURE,					\
		(COND_CODE_1(DT_NODE_HAS_PROP(DT_DRV_INST(n), ti_cc_mode),	\
			(.cmode = MSPM0_CAPTURE_MODE(				\
				DT_STRING_TOKEN(DT_DRV_INST(n), ti_cc_mode)),),\
			()))) };                                 \
										\
	PINCTRL_DT_INST_DEFINE(n);                                                                 \
	MSP_CC_IRQ_REGISTER_IF_CAPTURE(n)                                                        \
										\
	static const struct pwm_mspm0_config pwm_mspm0_config_##n = {				\
		.base = (struct mspm0_gptimer_regs *)DT_REG_ADDR(DT_INST_PARENT(n)),		\
		.clock_dev = DEVICE_DT_GET(DT_CLOCKS_CTLR_BY_IDX(DT_INST_PARENT(n), 0)),           \
		.pincfg = PINCTRL_DT_INST_DEV_CONFIG_GET(n),                                       \
		.clock_subsys = {						\
			.clk = DT_CLOCKS_CELL_BY_IDX(DT_INST_PARENT(n), 0, clk),\
		},								\
		.clk_sel = MSPM0_CLOCK_PERIPH_REG_MASK(                                            \
			DT_CLOCKS_CELL_BY_IDX(DT_INST_PARENT(n), 0, clk)),                         \
		.clk_div_reg = DT_PROP(DT_INST_PARENT(n), ti_clk_div) - 1U,                        \
		.prescaler = DT_PROP(DT_INST_PARENT(n), ti_clk_prescaler),                         \
		.mode = COND_CODE_1(DT_NODE_HAS_PROP(DT_DRV_INST(n),		\
						     ti_pwm_mode),		\
			(MSPM0_PWM_MODE(					\
				DT_STRING_TOKEN(DT_DRV_INST(n), ti_pwm_mode))),\
			(PWM_MSPM0_EDGE_ALIGN)),                                                   \
		.cc_idx = {DT_INST_FOREACH_PROP_ELEM(n, ti_cc_index,		\
					  MSPM0_CC_IDX_ARRAY)			\
		},								\
		.cc_idx_cnt = DT_INST_PROP_LEN(n, ti_cc_index),			\
		.is_capture = DT_NODE_HAS_PROP(DT_DRV_INST(n), ti_cc_mode),	\
		IF_ENABLED(CONFIG_PWM_CAPTURE,					\
		(.irq_config_func = COND_CODE_1(DT_NODE_HAS_PROP(DT_DRV_INST(n), ti_cc_mode),	\
						(mspm0_pwm_##n##_irq_register), (NULL))))	\
	};									\
										\
	DEVICE_DT_INST_DEFINE(n,						\
			      pwm_mspm0_init,					\
			      NULL,						\
			      &pwm_mspm0_data_ ## n,				\
			      &pwm_mspm0_config_ ## n,				\
			      POST_KERNEL, CONFIG_PWM_INIT_PRIORITY,		\
			      &pwm_mspm0_driver_api);

DT_INST_FOREACH_STATUS_OKAY(PWM_DEVICE_INIT_MSPM0)
